Repository: dongri727/chronomap-in-maritime
Catalog: lib/l10n/app_*.arb
Languages: fr, ja

# cover
source: assets/images/cover_en.png
fr: assets/images/cover_fr.png
ja: assets/images/cover_ja.png

# infoA
source: This is an application specialized in the input and output of data related to the maritime events from the "ChronoMap". The "ChronoMap" is a database that encompasses all historical events from the origin of the universe to the endless 'now,' without regard to field. It aims to accurately display temporal and spatial distances, with 'when' and 'where' as mandatory items.
fr: Il s'agit d'une application spécialisée dans l'entrée et la sortie de données liées aux événements maritimes de la "ChronoMap". La "ChronoMap" est une base de données qui englobe tous les événements historiques depuis l'origine de l'univers jusqu'à l'éternel 'maintenant,' sans égard au domaine. Elle vise à afficher correctement les distances temporelles et spatiales, avec 'quand' et 'où' comme éléments obligatoires.
ja: これは『四次元年表』のうち、海事に関連するデータの入・出力に特化したアプリです。『四次元年表』とは宇宙の始原から終わりなき「今」に至る、全ての歴史的事象を、分野にかかわらず網羅するデータベースです。「いつ」だけでなく、｢どこで｣を必須項目とし、時間的距離、空間的距離を正しく表示することを目指します。

# infoB
source: Web version of "ChronoMap"
fr: Version web de la "ChronoMap"
ja: web版『四次元年表』

# infoC
source: Web version of 3Dl and 4D views
fr: Version web des vues 3D et 4D
ja: web版三次元・四次元表示

# infoD
source: How to use the "ChronoMap"
fr: Comment utiliser la "ChronoMap"
ja: 『四次元年表』の使い方

# infoE
source: This app does not acquire any of your personal information, nor does it track or use information on your device.
fr: Cette application ne récupère aucune de vos informations personnelles, ni ne suit ni n'utilise les informations de votre appareil.
ja: このアプリは、あなたのどんな個人情報も一切取得しませんし、あなたのデバイス中の情報を追跡、利用することもありません。

# infoF
source: The historical information you register is not linked to you. There are no records of what you register or search for.
fr: Les informations historiques que vous enregistrez ne vous sont pas liées. Il n'y a pas d'enregistrement de ce que vous inscrivez ou recherchez.
ja: あなたが登録してくださった歴史情報があなたと紐付けられることはありません。あなたがなにを登録し、なにを検索したかはについて、記録は一切残りません。

# infoG
source: Information contrary to the purpose of the "ChronoMap" will be handled by the administrator as follows. 1. Correction 2. Viewing stop (may be made public in the future) 3. Deletion
fr: Les informations contraires aux objectifs de la "ChronoMap" seront traitées par l'administrateur de la manière suivante. 1. Correction 2. Arrêt de la visualisation (peut être rendu public à l'avenir) 3. Suppression
ja: 『四次元年表』の趣旨に反する情報は、運営者によって以下の対応を取ります。 １、修正 ２、閲覧停止（将来公開される可能性あり） ３、削除

# infoH
source: The historical information you register is treated as a public good, and you yourself cannot delete it. Please be careful not to write personal information. If you want to delete information registered by mistake or find information that should be deleted, please contact the following address.
fr: Les informations historiques que vous enregistrez sont traitées comme un bien public, et vous-même ne pouvez pas les supprimer. Veuillez faire attention à ne pas écrire d'informations personnelles. Si vous souhaitez supprimer des informations enregistrées par erreur ou trouver des informations qui devraient être supprimées, veuillez contacter l'adresse suivante.
ja: 登録いただいた歴史情報は公共財として扱われ、登録したあなた自身でも削除することはできません。個人情報等を書き込まないようご注意ください。誤って登録した情報を削除したい場合、また、削除すべきと思われる情報を見つけた場合は、下記までご連絡ください。

# infoI
source: We are looking for people to join us in developing the "ChronoMap." If you are an engineer who can handle Flutter, AWS, PostgreSQL, Unity, etc., or can assist with data entry and correction, please contact us below.
fr: Nous recherchons des personnes pour nous rejoindre dans le développement de la "ChronoMap." Si vous êtes un ingénieur capable de gérer Flutter, AWS, PostgreSQL, Unity, etc., ou pouvez aider à la saisie et à la correction des données, veuillez nous contacter ci-dessous.
ja: 『四次元年表』開発をともにする方を求めています。Flutter、AWS、PostgreSQL, Unity等を扱えるエンジニアほか、データ入力やデータ修正等にご協力いただける方は、下記までご連絡ください。

# scalableA
source: This page plots and displays cosmic events registered in the database on an adjustable timeline. When you register data, it will be reflected in real-time.
fr: Cette page affiche et trace les événements cosmiques enregistrés dans la base de données sur une chronologie ajustable. Lorsque vous enregistrez des données, elles seront reflétées en temps réel.
ja: これは、データベースに登録されている宇宙関連の事象を伸縮可能な時間軸にプロットして表示するページです。データを登録すると、リアルタイムで反映されます。

# scalableB
source: Step 1 Be sure to press the Get button to obtain data.
fr: Étape 1 Appuyez toujours sur le bouton "Get" pour récupérer les données
ja: 手順１ データ取得のために、必ずGetボタンを押してください。

# scalableC
source: Step 2 The five options at the bottom allow you to select the initial display area. You can scroll through the entire timeline after the initial display.
fr: Étape 2 Les cinq options en bas vous permettent de sélectionner la zone d'affichage initiale. Vous pouvez faire défiler l'ensemble de la chronologie après l'affichage initial.
ja: 手順２ 下部の五つの選択肢は、初期表示の領域を選択します。いずれを選んでも、表示後にスクロールで全領域を見ることができます。

# scalableD
source: The logarithmic timeline is set with the year 2100 as the base, with time flowing from top to bottom. Events are fixed on the timeline, so events that occurred close in time are displayed near each other, while events that occurred over a longer span of time are displayed further apart. Zooming in will show details of events from the same era, while zooming out provides an overview of longer periods.
fr: La chronologie logarithmique est réglée avec l'année 2100 comme base, le temps s'écoulant de haut en bas. Les événements sont fixés sur la chronologie, de sorte que les événements qui se sont produits à des moments proches sont affichés près les uns des autres, tandis que les événements qui se sont produits sur une plus longue période sont affichés plus loin. En zoomant, les détails des événements de la même époque s'affichent, tandis qu'un zoom arrière permet d'avoir une vue d'ensemble des périodes plus longues.
ja: 2100年を基点とする対数時間軸を設定し、上から下に時代が流れます。事象は時間軸に固定されているので、近接して起こった事象は近くに、時間を経て起こった事象は遠くに表示されます。ズームインすると、同時代の詳細が表示され、ズームアウトすると、長い時代を概観することができます。

# scalableE
source: If you find any events plotted in the wrong position, please contact us at the following.
fr: Si vous trouvez des événements mal placés sur la chronologie, veuillez nous contacter à l'adresse suivante.
ja: プロット位置が間違っている事象を見つけた場合は、以下にご連絡ください。

# addHintA
source: In the "ChronoMap" a historical event refers to a singular occurrence equipped with "when" and "where" information. For instance, "Columbus's quest for a sea route to India" is not considered a singular event. A proper entry would look like: "October 12, 1492, Columbus reaches Guanahani Island in the West Indies, Bahamas, San Salvador Island."
fr: Dans le Dans le "ChronoMap", un événement historique désigne une occurrence unique contenant des informations sur « quand » et « où ». Par exemple, « La recherche par Colomb d’une route maritime vers l’Inde » n’est pas considéré comme un événement unique. Une entrée correcte serait : « 12 octobre 1492, Colomb atteint l’île de Guanahani dans les Antilles, Bahamas, île San Salvador. »
ja: 『四次元年表』における歴史的事象とは、「いつ、どこで」の情報を備えた、単一のできごとを指します。例えば「コロンブスによるインド航路探索」は単一のできごととはみなされません。登録は 「1492年10月12日、コロンブス、西インド諸島グァナハニ島に到達、バハマ、サン・サルバドル島」のようになります。

# addHintB
source: To associate events and perform searches effectively, make use of search tags. Tap "Show Tags" to view existing tags. You can select one or multiple tags.
fr: Pour associer les événements et effectuer des recherches efficacement, utilisez les étiquettes de recherche. Touchez « Afficher les étiquettes » pour voir les étiquettes existantes. Vous pouvez en sélectionner une ou plusieurs.
ja: 各事象を関連付けて検索するために、検索タグを活用してください。「タグを表示」にタッチすると、既存のタグが表示されます。一つでも、複数でも、選択できます。

# addHintC
source: If you want to add a new search tag, type it into the "Enter Tag" field. Once you do so, the "Add Tag" button will appear. Tap it to add the new tag to the list of options, then select it.
fr: Si vous souhaitez ajouter une nouvelle étiquette de recherche, saisissez-la dans le champ « Saisir une étiquette ». Une fois cela fait, le bouton « Ajouter une étiquette » apparaîtra. Touchez-le pour ajouter la nouvelle étiquette à la liste des options, puis sélectionnez-la.
ja: 検索タグを追加したいときは、「タグを記入」に記入してください。記入すると「タグを追加」ボタンが現れますので、タッチしてください。新しいタグが選択肢に加わりますので、改めて選択してください。

# addHintD
source: For the "WHEN" section, first choose the unit using the dropdown button, then enter the year, month, and day. If the month or day is unknown, enter 0. However, note that events with month and day set to 0 may not retain the correct chronological order with other events in the same year.
fr: Pour la section « QUAND », commencez par choisir l’unité à l’aide du bouton déroulant, puis saisissez l’année, le mois et le jour. Si le mois ou le jour est inconnu, saisissez 0. Notez cependant que les événements avec un mois et un jour à 0 peuvent ne pas respecter l'ordre chronologique exact avec d'autres événements de la même année.
ja: WHENについては、ドロップダウンボタンで単位を選択してから、年月日を入力してください。月日がわからない場合は、０を記入してください。ただし、月日が０の事象については、同年内の他の事象との時間関係が前後する場合があります。

# addHintE
source: For the "WHERE" section, start by selecting a country name or ocean name, then add a place name or sea area name. While country and ocean names cannot be added, place names and sea area names can be. When you enter a new name, the "Add" button will appear. Tap it to add the name to the list of options, then select it.
fr: Pour la section « OÙ », commencez par sélectionner un nom de pays ou un nom d’océan, puis ajoutez un nom de lieu ou une zone maritime. Bien que les noms de pays et d’océans ne puissent pas être ajoutés, les noms de lieux et de zones maritimes peuvent l’être. Lorsque vous saisissez un nouveau nom, le bouton « Ajouter » apparaîtra. Touchez-le pour ajouter le nom à la liste des options, puis sélectionnez-le.
ja: WHEREについては、まず国名か大洋名を選択し、その後に地名、海域名を追加してください。国名、大洋名は追加できませんが、地名、海域名は追加できます。記入すると「追加」ボタンが現れますので、タッチしてください。新しい地名、海域名が選択肢に加わりますので、改めて選択してください。

# addHintF
source: Latitude and longitude should be entered in decimal format. There is no need to include a minus sign for southern latitude or western longitude. Events with latitude and longitude will be reflected immediately on all display screens. If latitude and longitude are not entered, the event will only be displayed on the Stretchable Timeline and CLASSIC view.
fr: Les coordonnées de latitude et longitude doivent être saisies au format décimal. Il n’est pas nécessaire d’ajouter un signe moins pour les latitudes sud ou les longitudes ouest. Les événements avec des coordonnées de latitude et de longitude seront reflétés immédiatement sur tous les écrans d’affichage. Si la latitude et la longitude ne sont pas saisies, l’événement ne sera affiché que sur la ligne temporelle extensible et la vue CLASSIC.
ja: 緯度、経度は十進法で入力してください。南緯、西経にマイナス記号をつける必要はありません。緯度経度が入力されている事象は、表示画面全てに即時反映されます。緯度経度が未記入の場合は、伸縮時間軸とCLASSIC表示にのみ反映されます。

# indexA
source: Register Events
fr: Enregistrer des Evénements
ja: 事象登録

# indexB
source: Scalable Timeline
fr: Chronologie Evolutive
ja: 伸縮時間軸

# indexC
source: Search & View
fr: Chercher et Voir
ja: 検索と表示

# name
source: Event(within 50 letters)
fr: Evénement(dans les 50 lettres)
ja: 事象名（50文字以内）

source: Show Options
fr: Efficher et sélectionner des options
ja: 選択肢を表示

# newWord
source: another port, island or sea
fr: Entrez le nom de port, île et la mer
ja: 追加したい港名、島名、海域名を記入

# newTag
source: Enter the tag you want to add
fr: Saisissez l’étiquette que vous souhaitez ajouter.
ja: 追加したいタグを記入

# addWord
source: add a new word
fr: Ajouter le mot
ja: 記入した名称を追加

# ifYouMayKnow
source: Please enter if you may know
fr: Si possible, veuillez également entrer les informations suivantes
ja: 可能なら以下もご記入ください

# searchA
source: Search
fr: Recherche
ja: 検索

# searchB
source: What narrows your search?
fr: Qu'est-ce qui restreint votre recherche ?
ja: なにで絞り込みますか

# searchC
source: Confirm
fr: Confirmer
ja: 確定

# searchHintA
source: Touch the "Show Tags" button and select one option from the list. Since cross-searching is not yet implemented, if you select multiple options, only the last one chosen will be valid.
fr: Touchez le bouton « Afficher les étiquettes » et sélectionnez une option dans la liste. Comme la recherche croisée n’est pas encore implémentée, si vous sélectionnez plusieurs options, seule la dernière choisie sera valide.
ja: 「タグを表示」ボタンに触れてください。選択肢を一つ選んでください。クロス検索未実装のため、複数選ぶと、最後に選んだ一つのみが有効になります。

# searchHintB
source: If you touch the "Show Results" button without selecting a tag, an error will occur. To display all items, please select the "All" tag.
fr: Si vous touchez le bouton « Afficher les résultats » sans sélectionner une étiquette, une erreur se produira. Pour afficher tous les éléments, sélectionnez l’étiquette « All ».
ja: タグを選択せずに「結果を表示」ボタンに触れるとエラーになります。全件を表示したい場合は、タグの「All」を選んでください。

# searchHintC
source: The "Show Results" screen offers four different display types. All show the same content.
fr: L’écran « Afficher les résultats » propose quatre types d’affichage différents. Tous montrent le même contenu.
ja: 「結果を表示」画面には、次の４種類があります。全て同じ内容が表示されます。

# searchHintD
source: CLASSIC: A traditional timeline where the date, event name, and location are displayed together.
fr: CLASSIC : Une chronologie traditionnelle où la date, le nom de l’événement et le lieu sont affichés ensemble.
ja: CLASSIC 年月日、事象名、地名が併記されたふつうの年表です。

# searchHintE
source: Atlantic / Pacific: A 3D view with a world map on the XY plane and the passage of time represented along the Z-axis. The view is fully rotatable in 360°. It is recommended to use this display in landscape mode.
fr: Atlantic / Pacific : Une vue 3D avec une carte du monde sur le plan XY et le passage du temps représenté le long de l’axe Z. La vue est entièrement rotative à 360°. Il est recommandé d’utiliser cet affichage en mode paysage.
ja: Atlantic / Pacific XY平面に世界地図、Z軸に沿って時間経過を示す三次元表示です。360°回転できます。横位置の画面でご利用になることを推奨します。

# searchHintF
source: Globe: A 3D view displayed on a globe. The view is fully rotatable in 360°. Note that the passage of time is not displayed in this format. Please refer to the other formats for time progression.
fr: Globe : Une vue 3D affichée sur un globe. La vue est entièrement rotative à 360°. Notez que le passage du temps n’est pas affiché dans ce format. Veuillez vous référer aux autres formats pour la progression temporelle.
ja: Globe 地球儀上に表示する三次元表示です。360°回転できます。時間経過は表示されませんので、他の形式でご確認ください。
